/*
 * Создать программу, которая выводит в консоль текст “Здравствуй 
 *  мир”
 */
package com.hm.hometasks.basistypes;

/**
 *
 * @author Osin Vladimir
 */
public class HelloWorld {

    public static void main(String[] args) {
        System.out.println("Hello World!");
    }

}
