/*
 * Создать программу, которая выводит в консоль текст “Здравствуй 
 *  мир”
 */
package hometasks.task1.subtask1.stask_1;

/**
 *
 * @author Osin Vladimir
 */
public class HelloWorld {

    public static void main(String[] args) {
        System.out.println("Здравствуй мир!");
    }

}
