/*
 * Создать в программе текстовую переменную (String) с 
 * произвольным текстом  размещенную на нескольких строках кода. 
 * Вывести текст в консоль
 */
package hometasks.task1.subtask1.stask_2;

/**
 *
 * @author Osin Vladimir
 */
public class LearnJava {

    public static void main(String[] args) {
        String s;
        s = "Да здравствует изучение Java!! "
                + "Хочу все знать!";
        System.out.println(s);
    }

}
